<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Sets pkg_path to an installer package for further processing. Intended to take place of a .downloads recipe when custom in house packages or paywall packages are used. Override this recipe for each package.</string>
    <key>Identifier</key>
    <string>com.github.ega-recipes.path.PkgPath</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Some_Installer_PKG</string>
        <key>pkg_path</key>
        <string>/path/to/some.pkg</string>
    </dict>
    <key>MinimumVersion</key>
	<string>0.2.0</string>
    <key>Process</key>
	<array>
	</array>
</dict>
</plist>