<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Import a Creative Cloud Application's pkg into package cache for further processing.</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.mov.Import Adobe 2021 Title</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>SomeAdobe2021Title</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
        	<dict>
                <key>Processor</key>
                <string>Adobe2021Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pkg_path%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Install-%version%.pkg</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>