<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Atom, makes a pkg of it, and uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.jss-recipes.jss.Atom</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Computer Science</string>
		<key>NAME</key>
		<string>Atom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.Atom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
