<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Canopy.</string>
	<key>Identifier</key>
	<string>edu.ncsu.oit.download.Canopy</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://storage-cf.enthought.com/installers/Canopy/canopy-2.1.8.macosx-x86_64-cp35.dmg?Expires=1521817975&amp;Signature=bMFbSl5-TOjpaqYu1MRkGcTr5zlF4zZfK7-75vtltS9T1SRVUdwEAZXDhuPsxfxem4hhWMQpWu7ybUvN9KbA61L~uBPxWd2ZmhRCzA0yNlmISbKcBmF41eNyLZJ95KFeK32xzSIkGzRpTjIL4fhhwqKZsBz2RNcONTnc0HT77tU_&amp;Key-Pair-Id=APKAI5KS27PL3EAUA27Q</string>
		<key>NAME</key>
		<string>Canopy</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
