<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Geogebra disk image, builds a package, and uploads to the JSS.

Note: Geogebra 5 changes the package ID. The installer app ignores a previously installed Geogebra 4 and makes a subfolder to install into. This is not what is desired, thus, a preinstall script will remove old versions.</string>
	<key>Identifier</key>
	<string>com.github.jss-recipes.jss.Geogebra</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Science and Math</string>
		<key>NAME</key>
		<string>Geogebra</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.sheagcraig.pkg.Geogebra</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
