<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of XCreds and uploads the package to your JSS.</string>
	<key>Identifier</key>
	<string>com.github.xcreds.jamf.XCreds</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Setup</string>
		<key>NAME</key>
		<string>XCreds</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.xcreds.download.XCreds</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
		<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
	</array>
</dict>
</plist>
