<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Import a Creative Cloud Application's pkg into a JSS.</string>
        <key>Identifier</key>
        <string>com.github.dataJAR-recipes.jss.Import Adobe 2022 Title</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>SomeAdobe2022Title</string>
            <key>MINIMUM_OS_VERSION</key>
            <string>10.14.0</string>
        	<key>SELF_SERVICE_DESCRIPTION</key>
            <string>Some description.</string>
            <key>CATEGORY</key>
            <string>Productivity</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>PolicyTemplate.xml</string>
            <key>UNINSTALL_CATEGORY</key>
            <string>Uninstallers</string>
            <key>UNINSTALL_GROUP_NAME</key>
            <string>%NAME%-uninstall</string>
            <key>UNINSTALL_GROUP_TEMPLATE</key>
            <string>UninstallSmartGroupTemplate.xml</string>
            <key>UNINSTALL_POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>UNINSTALL_POLICY_TEMPLATE</key>
            <string>UninstallPolicyTemplate.xml</string>
            <key>SELF_SERVICE_ICON</key>
            <string></string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
        	<dict>
                <key>Processor</key>
                <string>Adobe2022Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pkg_path%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Install-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>JSSImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>jss_inventory_name</key>
                    <string>%jss_inventory_name%</string>
                    <key>pkg_path</key>
                    <string>%destination_path%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <string>%destination_path%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%uninstaller_pkg_path%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>JSSImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>category</key>
                    <string>%UNINSTALL_CATEGORY%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%UNINSTALL_GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%UNINSTALL_GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>jss_inventory_name</key>
                    <string>%jss_inventory_name%</string>
                    <key>pkg_path</key>
                    <string>%destination_path%</string>
                    <key>policy_category</key>
                    <string>%UNINSTALL_POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%UNINSTALL_POLICY_TEMPLATE%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <string>%destination_path%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>