<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Sets required input variables for a package</string>
    <key>Identifier</key>
    <string>edu.ncsu.ega.name.chrome</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UNCWide-AutoPkg-Cyberduck</string>
    </dict>
    <key>Process</key>
    <array>
    </array>
</dict>
</plist>